<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>All Make Easier</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description">
<meta property="og:type" content="website">
<meta property="og:title" content="All Make Easier">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="All Make Easier">
<meta property="og:description">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="All Make Easier">
<meta name="twitter:description">
  
    <link rel="alternate" href="/atom.xml" title="All Make Easier" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">All Make Easier</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main">
  
    <article id="post-Sublime-Compile-tex" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/05/24/Sublime-Compile-tex/" class="article-date">
  <time datetime="2016-05-24T04:19:28.000Z" itemprop="datePublished">2016-05-24</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/05/24/Sublime-Compile-tex/">Sublime compile tex not working</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="Problem"><a href="#Problem" class="headerlink" title="Problem"></a>Problem</h2><p>When using Sublime Text 2 + MacTex + Skim for the tex editing on mac, after all the setting, the compile of the sublime not working(using cmd + B, not working)</p>
<h2 id="Solve"><a href="#Solve" class="headerlink" title="Solve"></a>Solve</h2><p>At sublime text, go to: Preferences -&gt; Package Settings -&gt; Settings - User, and reset the package to the default, then the compile works.</p>
<p><img src="/2016/05/24/Sublime-Compile-tex/solve.png" alt="logo"></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/05/24/Sublime-Compile-tex/" data-id="cioky7ogv0002ya49iymkrobj" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Latex/">Latex</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-Grid-Growing-Clustering-Algorithm" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/04/23/Grid-Growing-Clustering-Algorithm/" class="article-date">
  <time datetime="2016-04-22T16:10:55.000Z" itemprop="datePublished">2016-04-23</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/04/23/Grid-Growing-Clustering-Algorithm/">Grid Growing Clustering Algorithm</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x5BF9;&#x4E8E;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x6570;&#x636E;&#x6316;&#x6398;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x6548;&#x7387;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6311;&#x6218;&#x3002;Grid Growing&#xFF08;<a href="http://sse.tongji.edu.cn/zhaoqinpei/" target="_blank" rel="external">http://sse.tongji.edu.cn/zhaoqinpei/</a>&#xFF09;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x7F51;&#x683C;&#x7684;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x628A;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x91CF;&#x5316;&#x4E3A;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x7F51;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x805A;&#x7C7B;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x5728;&#x5206;&#x51FA;&#x7684;&#x7F51;&#x683C;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x5B83;&#x7684;&#x7279;&#x70B9;&#x662F;&#x805A;&#x7C7B;&#x8FC7;&#x7A0B;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#xFF0C;&#x800C;&#x72EC;&#x7ACB;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x6709;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x3002;</p>
<h2 id="&#x57FA;&#x672C;&#x601D;&#x60F3;"><a href="#&#x57FA;&#x672C;&#x601D;&#x60F3;" class="headerlink" title="&#x57FA;&#x672C;&#x601D;&#x60F3;"></a>&#x57FA;&#x672C;&#x601D;&#x60F3;</h2><p>&#x5C06;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x5927;&#x5C0F;&#x76F8;&#x7B49;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x63A5;&#x7740;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x65B9;&#x5F0F;&#x9009;&#x53D6;m&#x4E2A;&#x79CD;&#x5B50;&#x70B9;&#xFF0C;&#x4ECE;&#x6BCF;&#x4E2A;&#x79CD;&#x5B50;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x9009;&#x53D6;&#x4E0E;&#x5B83;&#x4EEC;&#x76F8;&#x90BB;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x6570;&#x636E;&#x70B9;&#x6570;&#x5927;&#x4E8E;0&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x8FD9;&#x4E2A;&#x5355;&#x5143;&#x548C;&#x8FD9;&#x4E2A;&#x79CD;&#x5B50;&#x5355;&#x5143;&#x5212;&#x5206;&#x5230;&#x76F8;&#x540C;&#x7684;&#x7C07;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x8003;&#x5BDF;&#x8FD9;&#x4E9B;&#x76F8;&#x90BB;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x9012;&#x5F52;&#x5730;&#x5C06;&#x7C07;&#x6269;&#x5927;&#xFF0C;&#x76F4;&#x5230;&#x4E0D;&#x80FD;&#x5411;&#x5916;&#x6269;&#x5C55;&#x3002;</p>
<ul>
<li>Grid Growing&#x7684;&#x8F93;&#x5165;&#x53C2;&#x6570;</li>
</ul>
<ol>
<li>&#x9700;&#x8981;&#x9009;&#x53D6;&#x7684;&#x521D;&#x59CB;&#x79CD;&#x5B50;&#x5355;&#x5143;&#x7684;&#x6570;&#x91CF;m</li>
<li>&#x9009;&#x53D6;&#x79CD;&#x5B50;&#x5355;&#x5143;&#x7684;&#x65B9;&#x5F0F;  </li>
<li>&#x9700;&#x8981;&#x5C06;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x7B49;&#x5206;&#x7684;&#x53C2;&#x6570;(&#x6BCF;&#x4E2A;&#x7EF4;&#x5EA6;&#x9700;&#x8981;&#x7B49;&#x5206;&#x7684;&#x6570;&#x91CF;)</li>
</ol>
<p>&#x5728;&#x4E8C;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x53C2;&#x6570;Nx&#x548C;Ny&#x6765;&#x51B3;&#x5B9A;&#x5C06;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x5206;&#x6210;&#x7F51;&#x683C;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x90E8;&#x5206;&#x7F51;&#x683C;&#x662F;&#x4E0D;&#x5305;&#x542B;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x5C06;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x5206;&#x4E3A;2 * 2&#x7684;&#x60C5;&#x51B5;: </p>
<p><img src="/2016/04/23/Grid-Growing-Clustering-Algorithm/GridGrowing1.png" alt="logo"></p>
<p>&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x9009;&#x53D6;&#x6240;&#x6709;&#x6570;&#x636E;&#x70B9;&#x4E2D;&#x6BCF;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x6700;&#x5927;&#x503C;&#x548C;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5DEE;&#x503C;&#x7B49;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x7B49;&#x5206;&#x3002;&#x4E0A;&#x56FE;&#x4E2D;x&#x7EF4;&#x5EA6;&#x6700;&#x5927;&#x503C;&#x548C;&#x6700;&#x5C0F;&#x503C;&#x5206;&#x522B;&#x662F;26&#x548C;2&#xFF0C;&#x90A3;&#x4E48;&#x628A;x&#x7EF4;&#x5EA6;&#x5206;&#x4E3A;2&#x4E2A;&#x7B49;&#x5206;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x7F51;&#x683C;&#x5728;x&#x7EF4;&#x5EA6;&#x7684;&#x957F;&#x5EA6;&#x4E3A;(26-2) / 2 = 12&#x3002;</p>
<p>&#x5728;&#x5C06;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x7B49;&#x5206;&#x4E3A;&#x82E5;&#x5E72;&#x7F51;&#x683C;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x7F51;&#x683C;&#x4E2D;&#x9009;&#x53D6;m (m&#x5C0F;&#x4E8E;&#x7F51;&#x683C;&#x6570;)&#x4E2A;&#x7F51;&#x683C;&#x4F5C;&#x4E3A;&#x79CD;&#x5B50;&#x5355;&#x5143;&#xFF0C;&#x9009;&#x53D6;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x4E09;&#x79CD;&#xFF1A;</p>
<ol>
<li>&#x9009;&#x53D6;&#x5BC6;&#x5EA6;&#x6700;&#x5927;&#x7684;(&#x5305;&#x542B;&#x6570;&#x636E;&#x70B9;&#x6700;&#x591A;)&#x7684;m&#x4E2A;&#x7F51;&#x683C;&#xFF0C;&#x5982;&#x56FE;3-7&#x4E2D;&#xFF0C;&#x5982;&#x679C;m=1&#xFF0C;&#x90A3;&#x4E48;&#x5219;&#x9009;&#x53D6;&#x5305;&#x542B;6&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x7684;&#x90A3;&#x4E2A;&#x7F51;&#x683C; </li>
<li>&#x91C7;&#x53D6;&#x968F;&#x673A;&#x7684;&#x65B9;&#x5F0F;&#x9009;&#x53D6;m&#x4E2A;&#x7F51;&#x683C; </li>
<li>&#x5728;&#x7A7A;&#x95F4;&#x4E2D;&#x5206;&#x5E03;&#x5747;&#x5300;&#x5730;&#x9009;&#x53D6;m&#x4E2A;&#x7F51;&#x683C;</li>
</ol>
<p>&#x5728;&#x7B26;&#x5408;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x6700;&#x597D;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x4E5F;&#x80FD;&#x53D6;&#x5F97;&#x51FA;&#x8F83;&#x597D;&#x7684;&#x805A;&#x7C7B;&#x7ED3;&#x679C;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x4E00;&#x4E9B;&#x5206;&#x5E03;&#x6574;&#x9F50;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;&#x65B9;&#x6CD5;&#x4E09;&#x7684;&#x9009;&#x53D6;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x6700;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>Grid Growing&#x7B97;&#x6CD5;&#x6700;&#x5173;&#x952E;&#x7684;&#x6B65;&#x9AA4;&#x662F;&#x4ECE;&#x79CD;&#x5B50;&#x70B9;&#x5F00;&#x59CB;&#x5411;&#x5916;&#x6269;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6BCF;&#x4E2A;&#x7C07;&#x5F62;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4E0B;&#x56FE;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x88AB;&#x5206;&#x4E3A;&#x4E86;8 * 4&#x7684;32&#x4E2A;&#x7F51;&#x683C;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;&#x5BC6;&#x5EA6;&#x6700;&#x5927;&#x7684;&#x4E24;&#x4E2A;&#x7F51;&#x683C;&#x7684;&#x7F16;&#x53F7;&#x4E3A;(3, 2)&#x548C;(7, 4)&#xFF0C;&#x4ED6;&#x4EEC;&#x5206;&#x522B;&#x542B;&#x6709;10&#x548C;13&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x3002;</p>
<p><img src="/2016/04/23/Grid-Growing-Clustering-Algorithm/GridGrowing2.png" alt="logo"></p>
<p>&#x5728;&#x4E8C;&#x7EF4;&#x7F51;&#x683C;&#x4E2D;&#xFF0C;&#x4ECE;&#x79CD;&#x5B50;&#x7F51;&#x683C;&#x8003;&#x5BDF;&#x5B83;&#x5468;&#x56F4;&#x7684;&#x516B;&#x4E2A;&#x7F51;&#x683C;&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x4E48;&#x7F51;&#x683C;&#x7684;&#x5BC6;&#x5EA6;&#x5927;&#x4E8E;0&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7F51;&#x683C;&#x548C;&#x8FD9;&#x4E2A;&#x79CD;&#x5B50;&#x7F51;&#x683C;&#x5C31;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x533A;&#x57DF;(Region)&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x70B9;&#x5C31;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x7C07;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x8FD9;&#x4E2A;&#x7F51;&#x683C;&#x4E5F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x79CD;&#x5B50;&#x70B9;&#x8FDB;&#x884C;&#x8003;&#x5BDF;&#x5B83;&#x5468;&#x56F4;&#x7684;&#x516B;&#x4E2A;&#x7F51;&#x683C;&#xFF0C;&#x6309;&#x7167;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x9012;&#x5F52;&#x5730;&#x6269;&#x5927;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5C31;&#x80FD;&#x6269;&#x5927;&#x4E86;&#x8FD9;&#x4E2A;&#x7C07;&#x3002;<br>&#x56FE;&#x4E2D;&#xFF0C;&#x7F16;&#x53F7;&#x4E3A;(2, 2)&#x7684;&#x7F51;&#x683C;&#x662F;&#x79CD;&#x5B50;&#x7F51;&#x683C;(3, 2)&#x7684;&#x90BB;&#x5C45;&#x7F51;&#x683C;&#xFF0C;&#x800C;&#x7F16;&#x53F7;&#x4E3A;(1, 1)&#x7684;&#x7F51;&#x683C;&#x53C8;&#x662F;&#x7F51;&#x683C;(2, 2)&#x7684;&#x90BB;&#x5C45;&#x7F51;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x540C;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x805A;&#x7C7B;&#x7ED3;&#x679C;:</p>
<p><img src="/2016/04/23/Grid-Growing-Clustering-Algorithm/GridGrowing2.png" alt="logo"></p>
<h2 id="&#x7B97;&#x6CD5;&#x4F2A;&#x4EE3;&#x7801;"><a href="#&#x7B97;&#x6CD5;&#x4F2A;&#x4EE3;&#x7801;" class="headerlink" title="&#x7B97;&#x6CD5;&#x4F2A;&#x4EE3;&#x7801;"></a>&#x7B97;&#x6CD5;&#x4F2A;&#x4EE3;&#x7801;</h2><pre><code class="java">    Input&#xFF1A;&#x6570;&#x636E;&#x96C6;D&#xFF0C;&#x5206;&#x5272;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;Nx, Ny, Nz....., &#x79CD;&#x5B50;&#x7F51;&#x683C;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x9009;&#x62E9;&#x79CD;&#x5B50;&#x7F51;&#x683C;&#x7684;&#x65B9;&#x5F0F;
    Output&#xFF1A; &#x6240;&#x6709;&#x6570;&#x636E;&#x6240;&#x5C5E;&#x7C07;&#x7684;&#x7F16;&#x53F7;

    GridGrowingClustering(D, Nx, Ny, random, m){
      Grids = getGrids(D,Nx,Ny)
      SeedGrids = getSeedByRandom(Grids)
      ClusterNumber = <span class="number">1</span>
      For each seed in SeedGrids{
        <span class="keyword">if</span> seed is not visited
            mark seed as visited
            neighborhood = getNeighbors(seed, Grids)
            qulifiedNeighborhood = notEmptyNeighors(neighborhood)
            <span class="function">mark qulifiedNeighborhood as visited
            mark ClusterNumber to seed and qulifiedNeighborhood
            <span class="title">ExpandRegion</span><span class="params">(qulifiedNeighborhood, ClusterNumber,Grids)</span>
            ClusterNumber </span>= ClusterNumber + <span class="number">1</span>
  }
    }

    ExpandRegion(neighborhood, ClusterNumber,Grids){
      For each grid in neighborhood{
        neighborhood&#x2019; = getNeighbors(grid, Grids)
        qulifiedNeighborbood&#x2019; = notEmptyNeighbors(neighborhood&#x2019;)
        mark qulifiedNeighborhood&#x2019; as visited
        mark ClusterNumber to qulifedNeighborhood&#x2019;.<span class="function">clusterNumer
        <span class="title">ExpandRegion</span><span class="params">(qulifedNeighborhood&#x2019;, ClusterNumber, Grids)</span>
  }    
}</span>
</code></pre>
<h2 id="&#x590D;&#x6742;&#x5EA6;"><a href="#&#x590D;&#x6742;&#x5EA6;" class="headerlink" title="&#x590D;&#x6742;&#x5EA6;"></a>&#x590D;&#x6742;&#x5EA6;</h2><p>  Grid Growing&#x7B97;&#x6CD5;&#x5728;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x904D;&#x5386;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x7F51;&#x683C;&#x7684;&#x4E2A;&#x6570;&#x6709;&#x5173;&#xFF0C;&#x800C;&#x7F51;&#x683C;&#x7684;&#x4E2A;&#x6570;&#x7531;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x51B3;&#x5B9A;&#x3002;<br>  &#x4EE5;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x8003;&#x8651;&#xFF0C;&#x82E5;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#x4E3A;N&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x7B49;&#x5206;&#x4E3A;Nx <em> Ny&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x90A3;&#x4E48;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4E3A; t = 2N + 9 </em> Nx <em> Ny&#xFF0C;&#x56E0;&#x6B64;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E3A;O(N + Nx </em> Ny)&#xFF0C;&#x800C;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;Nx&#x548C;Ny&#x7684;&#x53D6;&#x503C;&#x65F6;&#xFF0C;&#x90FD;&#x4F7F;&#x5F97;Nx * Ny &#x8FDC;&#x5C0F;&#x4E8E; N&#xFF0C;&#x56E0;&#x6B64;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x53EF;&#x4EE5;&#x662F;O(N)&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#xFF0C;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x6548;&#x7387;&#x4F18;&#x52BF;&#x3002;</p>
<h2 id="&#x4F18;&#x7F3A;&#x70B9;&#x5206;&#x6790;"><a href="#&#x4F18;&#x7F3A;&#x70B9;&#x5206;&#x6790;" class="headerlink" title="&#x4F18;&#x7F3A;&#x70B9;&#x5206;&#x6790;"></a>&#x4F18;&#x7F3A;&#x70B9;&#x5206;&#x6790;</h2><p>Grid Growing&#x662F;&#x57FA;&#x4E8E;&#x7F51;&#x683C;&#x7684;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x517C;&#x6709;DBSCAN&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x5B83;&#x7684;</p>
<ul>
<li>&#x4F18;&#x70B9;&#xFF1A;</li>
</ul>
<ol>
<li>&#x7B97;&#x6CD5;&#x8FC7;&#x7A0B;&#x4F9D;&#x8D56;&#x4E8E;&#x5206;&#x5272;&#x51FA;&#x6765;&#x7684;&#x6240;&#x6709;&#x7F51;&#x683C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x548C;&#x5176;&#x4ED6;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#x3002;</li>
<li>&#x5B83;&#x6269;&#x5C55;&#x7C07;&#x7684;&#x65B9;&#x5F0F;&#x548C;DBSCAN&#x76F8;&#x540C;&#xFF0C;&#x5747;&#x91C7;&#x7528;&#x4ECE;&#x79CD;&#x5B50;&#x70B9;&#x5411;&#x5916;&#x6269;&#x5C55;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x53D1;&#x73B0;&#x7C07;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x4EFB;&#x610F;&#x5F62;&#x72B6;&#x7684;&#x7C07;&#x3002;</li>
<li>&#x5B83;&#x5BF9;&#x566A;&#x58F0;&#x70B9;&#x654F;&#x611F;&#xFF0C;&#x5F00;&#x59CB;&#x6CA1;&#x6709;&#x88AB;&#x9009;&#x4E3A;&#x79CD;&#x5B50;&#x7F51;&#x683C;&#x6216;&#x8005;&#x4E4B;&#x540E;&#x6CA1;&#x6709;&#x88AB;&#x6269;&#x5C55;&#x5230;&#x7684;&#x7F51;&#x683C;&#x90FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x566A;&#x58F0;&#xFF0C;&#x56E0;&#x6B64;&#x805A;&#x7C7B;&#x7ED3;&#x679C;&#x4E0D;&#x6613;&#x53D7;&#x5230;&#x566A;&#x58F0;&#x7684;&#x5E72;&#x6270;&#x3002;</li>
</ol>
<ul>
<li>&#x7F3A;&#x70B9;&#xFF1A;</li>
</ul>
<ol>
<li>&#x8F93;&#x5165;&#x53C2;&#x6570;&#x8F83;&#x591A;&#xFF0C;&#x9700;&#x8981;&#x82B1;&#x6BD4;&#x8F83;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x53C2;&#x6570;&#x7684;&#x9009;&#x53D6;&#x4E0A;&#xFF0C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x964D;&#x4F4E;&#x4E86;&#x7B97;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#x6027;&#xFF1A;&#x5C06;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x5206;&#x5272;&#x6210;&#x7B49;&#x5206;&#x7684;&#x7F51;&#x683C;&#x7684;&#x591A;&#x5C11;&#x5BF9;&#x6700;&#x7EC8;&#x7684;&#x805A;&#x7C7B;&#x7ED3;&#x679C;&#x6709;&#x7740;&#x5F88;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#xFF0C;&#x624D;&#x80FD;&#x5F97;&#x5230;&#x6700;&#x4F18;&#x7684;&#x5206;&#x5272;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x79CD;&#x5B50;&#x7F51;&#x683C;&#x7684;&#x4E2A;&#x6570;m&#x9700;&#x8981;&#x8BA4;&#x4E3A;&#x6307;&#x5B9A;&#xFF0C;&#x5168;&#x51ED;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x5C1D;&#x8BD5;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x7C7B;&#x7C07;&#x4E2A;&#x6570;&#x624D;&#x80FD;&#x63A5;&#x8FD1;&#x9884;&#x671F;&#x3002;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x79CD;&#x5B50;&#x7F51;&#x683C;&#x7684;&#x9009;&#x53D6;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x6700;&#x4F18;&#x7684;&#x9009;&#x53D6;&#x3002;</li>
<li>&#x7EFC;&#x5408;&#x4E0A;&#x9762;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x603B;&#x7684;&#x8BF4;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x6027;&#x80FD;&#x4E0A;&#x6709;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5904;&#x7406;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x7EC4;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x6700;&#x4F18;&#x89E3;&#x3002;</li>
</ol>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/04/23/Grid-Growing-Clustering-Algorithm/" data-id="cioky7ogn0000ya49osupeasl" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-3Sum-Java-Solution" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/04/22/3Sum-Java-Solution/" class="article-date">
  <time datetime="2016-04-22T15:10:29.000Z" itemprop="datePublished">2016-04-22</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/04/22/3Sum-Java-Solution/">3Sum Java Solution</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x6765;&#x81EA;LeetCode&#x7684;3Sum&#x95EE;&#x9898;<br>Given an array S of n integers, are there elements a, b, c in S such that a + b + c = 0?<br>Find all unique triplets in the array which gives the sum of zero.</p>
<p> Note:<br> Elements in a triplet (a,b,c) must be in non-descending order. (ie, a &#x2264; b &#x2264; c)<br> The solution set must not contain duplicate triplets.<br> For example, given array S = {-1 0 1 2 -1 -4},</p>
<p> A solution set is:<br> (-1, 0, 1)<br> (-1, -1, 2)</p>
<h2 id="&#x89E3;&#x51B3;&#x601D;&#x8DEF;"><a href="#&#x89E3;&#x51B3;&#x601D;&#x8DEF;" class="headerlink" title="&#x89E3;&#x51B3;&#x601D;&#x8DEF;"></a>&#x89E3;&#x51B3;&#x601D;&#x8DEF;</h2><h3 id="2Sum-&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;"><a href="#2Sum-&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;" class="headerlink" title="2Sum &#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;"></a>2Sum &#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;</h3><p>2Sum&#x89E3;&#x51B3;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF1A;&#x4ECE;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x627E;&#x5230;&#x76F8;&#x52A0;&#x7684;&#x548C;&#x4E3A;&#x6307;&#x5B9A;&#x7684;&#x67D0;&#x4E2A;&#x6570;k&#x7684;&#x6570;&#x503C;&#x5BF9;&#x3002;<br>&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x5148;&#x5C06;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5229;&#x7528;&#x4E24;&#x4E2A;&#x6307;&#x9488;p&#x548C;q&#xFF0C;&#x5206;&#x522B;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#xFF0C;&#x6BCF;&#x6B21;&#x6BD4;&#x8F83;&#x6307;&#x9488;&#x6307;&#x5411;&#x7684;&#x4E24;&#x4E2A;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x76F8;&#x52A0;&#x7684;&#x548C;&#x5927;&#x4E8E;k&#xFF0C;&#x90A3;&#x4E48;q&#x5F80;&#x524D;&#x79FB;&#x4E00;&#x4F4D;&#xFF0C;&#x5982;&#x679C;&#x5C0F;&#x4E8E;k&#xFF0C;&#x90A3;&#x4E48;p&#x5F80;&#x540E;&#x79FB;&#x4E00;&#x4F4D;&#x3002;&#x6240;&#x4EE5;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x6709;&#x4E24;&#x90E8;&#x5206;:</p>
<ol>
<li>&#x6392;&#x5E8F;: O(NlogN)</li>
<li>&#x6307;&#x9488;&#x904D;&#x5386;&#x4E00;&#x904D;: O(N)</li>
</ol>
<h3 id="3Sum-&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;"><a href="#3Sum-&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;" class="headerlink" title="3Sum &#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;"></a>3Sum &#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;</h3><p>&#x5229;&#x7528;2Sum&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5C06;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;a&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x627E;&#x5230;&#x6570;&#x7EC4;&#x4E2D;&#x53E6;&#x5916;&#x7684;&#x4E24;&#x4E2A;&#x6570;b&#x548C;c&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x548C;&#x4E3A;b+c = -a&#x3002; &#x5728;&#x8FD9;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E3A;:</p>
<ol>
<li>&#x6392;&#x5E8F;&#x82B1;&#x8D39;: O(NlogN)</li>
<li>&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;a&#x7684;2Sum&#x67E5;&#x627E;: O(N*N)</li>
</ol>
<p>&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x53D6;&#x51FA;&#x91CD;&#x590D;&#x4E09;&#x5143;&#x7EC4;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E24;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x5728;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x6570;&#x8FC7;&#x540E;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5F80;&#x540E;&#x6216;&#x8005;&#x5F80;&#x524D;&#x79FB;&#x52A8;&#x4E00;&#x4F4D;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x6570;&#x7684;&#x4F4D;&#x7F6E;</li>
<li>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x91CD;&#x590D;&#xFF0C;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;a&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5728;a&#x7684;&#x540E;&#x9762;&#x4F4D;&#x7F6E;&#x4E0A;&#x5BFB;&#x627E;&#x6EE1;&#x8DB3;b+c=-a&#x7684;&#x4E24;&#x4E2A;&#x6570;</li>
</ol>
<p>&#x4EE5;&#x4E0B;&#x4E3A;java&#x4EE3;&#x7801;&#xFF0C;</p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span> List&lt;List&lt;Integer&gt;&gt; threeSum(<span class="keyword">int</span>[] nums) {</span><br><span class="line"></span><br><span class="line">        List&lt;List&lt;Integer&gt;&gt; retVal = <span class="keyword">new</span> ArrayList&lt;List&lt;Integer&gt;&gt;();</span><br><span class="line">        <span class="keyword">if</span> (nums.length&lt;<span class="number">3</span>) <span class="keyword">return</span> retVal;</span><br><span class="line">        <span class="keyword">int</span>[] clonedNums = nums.clone();</span><br><span class="line">        Arrays.sort(clonedNums);</span><br><span class="line">        <span class="keyword">int</span> length = nums.length;</span><br><span class="line"></span><br><span class="line">        <span class="keyword">for</span> (<span class="keyword">int</span> i=<span class="number">0</span>; i&lt;length-<span class="number">2</span>;) {</span><br><span class="line">            outLoop:</span><br><span class="line">            <span class="keyword">for</span> (<span class="keyword">int</span> start=i+<span class="number">1</span>, end=length-<span class="number">1</span>; start&lt;end; ) {</span><br><span class="line">                inLoop:</span><br><span class="line">                <span class="keyword">if</span> (clonedNums[start] + clonedNums[end] &gt; -clonedNums[i]) {</span><br><span class="line">                    <span class="comment">//move backword the end pointer</span></span><br><span class="line">                    <span class="keyword">if</span> (end &gt; <span class="number">0</span>) {</span><br><span class="line">                        <span class="keyword">int</span> moves = <span class="number">1</span>;</span><br><span class="line">                        <span class="keyword">while</span> (end-moves&gt;=<span class="number">0</span> &amp;&amp; clonedNums[end]==clonedNums[end-moves]) moves++;</span><br><span class="line">                        end -= moves;</span><br><span class="line">                    }</span><br><span class="line">                } <span class="keyword">else</span> <span class="keyword">if</span> (clonedNums[start] + clonedNums[end] &lt; -clonedNums[i]) {</span><br><span class="line">                    <span class="comment">//move forward the start pointer</span></span><br><span class="line">                    <span class="keyword">if</span> (start &lt; length - <span class="number">1</span>) {</span><br><span class="line">                        <span class="keyword">int</span> moves = <span class="number">1</span>;</span><br><span class="line">                        <span class="keyword">while</span> (start + moves &lt; length &amp;&amp; clonedNums[start] == clonedNums[start + moves]) moves++;</span><br><span class="line">                        start += moves;</span><br><span class="line">                    }</span><br><span class="line">                } <span class="keyword">else</span> {</span><br><span class="line">                    <span class="keyword">if</span> (start!=i &amp;&amp; end!=i) {</span><br><span class="line">                        <span class="comment">//save one triplet</span></span><br><span class="line">                        Integer[] triplet = <span class="keyword">new</span> Integer[]{clonedNums[i], clonedNums[start], clonedNums[end]};</span><br><span class="line">                        Arrays.sort(triplet);</span><br><span class="line">                        retVal.add(Arrays.asList(triplet));</span><br><span class="line">                    }</span><br><span class="line"></span><br><span class="line">                    <span class="comment">//move backword the end pointer</span></span><br><span class="line">                    <span class="keyword">if</span> (end &gt; <span class="number">0</span>) {</span><br><span class="line">                        <span class="keyword">int</span> backwordMoves = <span class="number">1</span>;</span><br><span class="line">                        <span class="keyword">while</span> (end - backwordMoves&gt;=<span class="number">0</span> &amp;&amp; clonedNums[end] == clonedNums[end-backwordMoves]) backwordMoves++;</span><br><span class="line">                        end -= backwordMoves;</span><br><span class="line">                    }</span><br><span class="line"></span><br><span class="line">                    <span class="comment">//move forward the start pointer</span></span><br><span class="line">                    <span class="keyword">if</span> (start &lt; length - <span class="number">1</span>) {</span><br><span class="line">                        <span class="keyword">int</span> forwordMoves = <span class="number">1</span>;</span><br><span class="line">                        <span class="keyword">while</span> (start+forwordMoves&lt;length &amp;&amp; clonedNums[start] == clonedNums[start + forwordMoves]) forwordMoves++;</span><br><span class="line">                        start += forwordMoves;</span><br><span class="line">                    }</span><br><span class="line">                }</span><br><span class="line">            }</span><br><span class="line"></span><br><span class="line">            <span class="keyword">if</span> (i &lt; length - <span class="number">3</span>) {</span><br><span class="line">                <span class="keyword">int</span> moves = <span class="number">1</span>;</span><br><span class="line">                <span class="keyword">while</span> ((i + moves) &lt; length &amp;&amp; clonedNums[i] == clonedNums[i + moves]) moves++;</span><br><span class="line">                i += moves;</span><br><span class="line">            } <span class="keyword">else</span> <span class="keyword">break</span>;</span><br><span class="line">        }</span><br><span class="line">        <span class="keyword">return</span> retVal;</span><br><span class="line">    }</span><br></pre></td></tr></table></figure>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/04/22/3Sum-Java-Solution/" data-id="cioky7ogs0001ya490av85brb" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Latex/">Latex</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/Latex/" style="font-size: 10px;">Latex</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">May 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">April 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/05/24/Sublime-Compile-tex/">Sublime compile tex not working</a>
          </li>
        
          <li>
            <a href="/2016/04/23/Grid-Growing-Clustering-Algorithm/">Grid Growing Clustering Algorithm</a>
          </li>
        
          <li>
            <a href="/2016/04/22/3Sum-Java-Solution/">3Sum Java Solution</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Rambot Zhong<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>